Hi @amar-ysabie ,

Thank you for raising this question, your script was trying to create 5 ``fortios_system_sdwan`` resources, the later one would overwrite the previous one that is the reason you were seeing FOS deleted the pervious created zones, could you substitute your ``fortios_system_sdwan`` snippet with following one and try again, and add one more "zone" named ``virtual-wan-link`` into your sdwan.txt since that is predefined and can't be deleted by FOS, if not define terraform always try to delete that one.
```
resource "fortios_system_sdwan" "example_sdwan_zone" {
    dynamic "zone" {
    for_each = local.sdwan_data
      content {
        name = zone.key
    }
  }
}
```
```
[
  {
    "interface": "1",
    "zone": "virtual-wan-link",
    "gateway": "x.x.x.x"
  },
  {
    "interface": "2",
    "zone": "INTERNET",
    "gateway": "x.x.x.x"
  },
....
```
```
Terraform will perform the following actions:

  # fortios_system_sdwan.example_sdwan_zone will be created
  + resource "fortios_system_sdwan" "example_sdwan_zone" {
      + app_perf_log_period      = (known after apply)
      + duplication_max_num      = (known after apply)
      + dynamic_sort_subtable    = "false"
      + fail_detect              = (known after apply)
      + get_all_tables           = "false"
      + id                       = (known after apply)
      + load_balance_mode        = (known after apply)
      + neighbor_hold_boot_time  = (known after apply)
      + neighbor_hold_down       = (known after apply)
      + neighbor_hold_down_time  = (known after apply)
      + speedtest_bypass_routing = (known after apply)
      + status                   = (known after apply)

      + zone {
          + advpn_health_check       = (known after apply)
          + advpn_select             = (known after apply)
          + minimum_sla_meet_members = (known after apply)
          + name                     = "INTERNET"
          + service_sla_tie_break    = (known after apply)
        }
      + zone {
          + advpn_health_check       = (known after apply)
          + advpn_select             = (known after apply)
          + minimum_sla_meet_members = (known after apply)
          + name                     = "VLAN1001_2684354560"
          + service_sla_tie_break    = (known after apply)
        }
      + zone {
          + advpn_health_check       = (known after apply)
          + advpn_select             = (known after apply)
          + minimum_sla_meet_members = (known after apply)
          + name                     = "VLAN1002_2818572288"
          + service_sla_tie_break    = (known after apply)
        }
      + zone {
          + advpn_health_check       = (known after apply)
          + advpn_select             = (known after apply)
          + minimum_sla_meet_members = (known after apply)
          + name                     = "VLAN1003_2969567232"
          + service_sla_tie_break    = (known after apply)
        }
      + zone {
          + advpn_health_check       = (known after apply)
          + advpn_select             = (known after apply)
          + minimum_sla_meet_members = (known after apply)
          + name                     = "VLAN1004_3305111552"
          + service_sla_tie_break    = (known after apply)
        }
      + zone {
          + advpn_health_check       = (known after apply)
          + advpn_select             = (known after apply)
          + minimum_sla_meet_members = (known after apply)
          + name                     = "virtual-wan-link"
          + service_sla_tie_break    = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.
```

Thanks,
Maxx
